; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-32)
(:domain gripper-strips)
(:objects rooma roomb left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 )
(:init
(room rooma)
(room roomb)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(free left)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 roomb)
(at ball20 roomb)
(at ball21 roomb)
(at ball22 roomb)
(at ball23 roomb)
(at ball24 roomb)
(at ball25 roomb)
(at ball26 roomb)
(at ball27 roomb)
(at ball28 roomb)
(at ball29 roomb)
(at ball30 roomb)
(at ball31 roomb)
(at ball32 roomb)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at ball19 rooma)
(at ball20 rooma)
(at ball21 rooma)
(at ball22 rooma)
(at ball23 rooma)
(at ball24 rooma)
(at ball25 rooma)
(at ball26 rooma)
(at ball27 rooma)
(at ball28 rooma)
(at ball29 rooma)
(at ball30 rooma)
(at ball31 rooma)
(at ball32 rooma)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 16 of 32
2. (pick ball32 roomb left)
   deleted: (at ball32 roomb) (free left)
   added: (carry ball32 left)
   goals met: 16 of 32
3. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 16 of 32
4. (drop ball32 rooma left)
   deleted: (carry ball32 left)
   added: (at ball32 rooma) (free left)
   goals met: 17 of 32
5. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 17 of 32
6. (pick ball31 roomb left)
   deleted: (at ball31 roomb) (free left)
   added: (carry ball31 left)
   goals met: 17 of 32
7. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 17 of 32
8. (drop ball31 rooma left)
   deleted: (carry ball31 left)
   added: (at ball31 rooma) (free left)
   goals met: 18 of 32
9. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 18 of 32
10. (pick ball30 roomb left)
   deleted: (at ball30 roomb) (free left)
   added: (carry ball30 left)
   goals met: 18 of 32
11. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 18 of 32
12. (drop ball30 rooma left)
   deleted: (carry ball30 left)
   added: (at ball30 rooma) (free left)
   goals met: 19 of 32
13. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 19 of 32
14. (pick ball29 roomb left)
   deleted: (at ball29 roomb) (free left)
   added: (carry ball29 left)
   goals met: 19 of 32
15. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 19 of 32
16. (drop ball29 rooma left)
   deleted: (carry ball29 left)
   added: (at ball29 rooma) (free left)
   goals met: 20 of 32
17. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 20 of 32
18. (pick ball28 roomb left)
   deleted: (at ball28 roomb) (free left)
   added: (carry ball28 left)
   goals met: 20 of 32
19. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 20 of 32
20. (drop ball28 rooma left)
   deleted: (carry ball28 left)
   added: (at ball28 rooma) (free left)
   goals met: 21 of 32
21. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 21 of 32
22. (pick ball27 roomb left)
   deleted: (at ball27 roomb) (free left)
   added: (carry ball27 left)
   goals met: 21 of 32
23. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 21 of 32
24. (drop ball27 rooma left)
   deleted: (carry ball27 left)
   added: (at ball27 rooma) (free left)
   goals met: 22 of 32
25. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 22 of 32
26. (pick ball26 roomb left)
   deleted: (at ball26 roomb) (free left)
   added: (carry ball26 left)
   goals met: 22 of 32
27. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 22 of 32
28. (drop ball26 rooma left)
   deleted: (carry ball26 left)
   added: (at ball26 rooma) (free left)
   goals met: 23 of 32
29. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 23 of 32
30. (pick ball25 roomb left)
   deleted: (at ball25 roomb) (free left)
   added: (carry ball25 left)
   goals met: 23 of 32
31. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 23 of 32
32. (drop ball25 rooma left)
   deleted: (carry ball25 left)
   added: (at ball25 rooma) (free left)
   goals met: 24 of 32
33. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 24 of 32
34. (pick ball24 roomb left)
   deleted: (at ball24 roomb) (free left)
   added: (carry ball24 left)
   goals met: 24 of 32
35. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 24 of 32
36. (drop ball24 rooma left)
   deleted: (carry ball24 left)
   added: (at ball24 rooma) (free left)
   goals met: 25 of 32
37. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 25 of 32
38. (pick ball23 roomb left)
   deleted: (at ball23 roomb) (free left)
   added: (carry ball23 left)
   goals met: 25 of 32
39. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 25 of 32
40. (drop ball23 rooma left)
   deleted: (carry ball23 left)
   added: (at ball23 rooma) (free left)
   goals met: 26 of 32
41. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 26 of 32
42. (pick ball22 roomb left)
   deleted: (at ball22 roomb) (free left)
   added: (carry ball22 left)
   goals met: 26 of 32
43. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 26 of 32
44. (drop ball22 rooma left)
   deleted: (carry ball22 left)
   added: (at ball22 rooma) (free left)
   goals met: 27 of 32
45. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 27 of 32
46. (pick ball21 roomb left)
   deleted: (at ball21 roomb) (free left)
   added: (carry ball21 left)
   goals met: 27 of 32
47. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 27 of 32
48. (drop ball21 rooma left)
   deleted: (carry ball21 left)
   added: (at ball21 rooma) (free left)
   goals met: 28 of 32
49. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 28 of 32
50. (pick ball20 roomb left)
   deleted: (at ball20 roomb) (free left)
   added: (carry ball20 left)
   goals met: 28 of 32
51. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 28 of 32
52. (drop ball20 rooma left)
   deleted: (carry ball20 left)
   added: (at ball20 rooma) (free left)
   goals met: 29 of 32
53. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 29 of 32
54. (pick ball19 roomb left)
   deleted: (at ball19 roomb) (free left)
   added: (carry ball19 left)
   goals met: 29 of 32
55. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 29 of 32
56. (drop ball19 rooma left)
   deleted: (carry ball19 left)
   added: (at ball19 rooma) (free left)
   goals met: 30 of 32
57. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 30 of 32
58. (pick ball18 roomb left)
   deleted: (at ball18 roomb) (free left)
   added: (carry ball18 left)
   goals met: 30 of 32
59. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 30 of 32
60. (drop ball18 rooma left)
   deleted: (carry ball18 left)
   added: (at ball18 rooma) (free left)
   goals met: 31 of 32
61. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 31 of 32
62. (pick ball17 roomb left)
   deleted: (at ball17 roomb) (free left)
   added: (carry ball17 left)
   goals met: 31 of 32
63. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 31 of 32
64. (drop ball17 rooma left)
   deleted: (carry ball17 left)
   added: (at ball17 rooma) (free left)
   goals met: 32 of 32
